Autodesk.Revit.DB.SlabShapeEditor.AddSplitLine(Autodesk.Revit.DB.SlabShapeVertex,Autodesk.Revit.DB.SlabShapeVertex)
Add a split line to the element.
Remarks:
Adding a split line may result in multiple creases, for example when the line crosses existing creases or boundary edges.
startVertex:
Start vertex
endVertex:
End vertex
Returns:
The newly created creases after adding the split line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.SlabShapeEditor.AddPoint(Autodesk.Revit.DB.XYZ)
Add a point to the element.
Remarks:
The newly added point should be inside the element boundary on the x-y plane.
SlabShapeEditor must be enabled before calling this method.
Regenerate the document after element creation if this method is called in the same transaction.
Returns:
the newly added slab shape vertex.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2025

Autodesk.Revit.DB.SlabShapeEditor.AddPoints(System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Add an array of points to the element.
Remarks:
The newly added points should be distinct on the x-y plane, and they should be inside the element boundary.
SlabShapeEditor must be enabled before calling this method.
Regenerate the document after element creation if this method is called in the same transaction.
points:
The point array.
Returns:
The newly added slab shape vertices.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input points are not valid. Please check if they are distinct on the x-y plane.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024.2

Autodesk.Revit.DB.SlabShapeEditor.DeletePoint(Autodesk.Revit.DB.SlabShapeVertex)
Delete a SlabShapeVertex from the element.
Remarks:
Corner vertices are created right after the SlabShapeEditor is enabled.
They are tied with the boundaries so that they could not be deleted individually.
They can only be deleted using ResetSlabShape.
vertex:
The SlabShapeVertex to be deleted.
Returns:
True if the vertex is successfully deleted.
False if the vertex is not found or could not be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024.1